# <b>PANDAS</b>

In [1]:
import pandas as pd

In [2]:
s1=pd.Series((1,3,5,7,4,3,9,0))
s1

0    1
1    3
2    5
3    7
4    4
5    3
6    9
7    0
dtype: int64

In [3]:
s1=pd.Series({'num1':[2,3,6,7],'num2':[3,5,7,4]})
s1

num1    [2, 3, 6, 7]
num2    [3, 5, 7, 4]
dtype: object

In [4]:
s2=pd.Series(data=[23,34,56],index=['item1','item2','item3'])
s2

item1    23
item2    34
item3    56
dtype: int64

In [5]:
dict={'name':['Sneha','Muskan','Aparna','Shreya','Rahul'],
'Age':[20,21,34,45,23],'Language':['Python','C++','Python','Java','C++'],'Experience_yr':[2,0,2,5,3]}
details = pd.DataFrame(dict,index = ['Person1','Person2','Person3','Person4','Person5'])
details

           name  Age Language  Experience_yr
Person1   Sneha   20   Python              2
Person2  Muskan   21      C++              0
Person3  Aparna   34   Python              2
Person4  Shreya   45     Java              5
Person5   Rahul   23      C++              3

<font color='red'> Logical Indexing</font>

In [7]:
details[details['Age']>20]

           name  Age Language  Experience_yr
Person2  Muskan   21      C++              0
Person3  Aparna   34   Python              2
Person4  Shreya   45     Java              5
Person5   Rahul   23      C++              3

In [8]:
details[details['Language']=='Python']

           name  Age Language  Experience_yr
Person1   Sneha   20   Python              2
Person3  Aparna   34   Python              2

In [9]:
details['Experience_yr']>1

Person1     True
Person2    False
Person3     True
Person4     True
Person5     True
Name: Experience_yr, dtype: bool

In [10]:
details[(details['Language']=='Python') & (details['Experience_yr']>1) & (details['Age']>20)]

           name  Age Language  Experience_yr
Person3  Aparna   34   Python              2